Repository: cyandm/iprefab
Catalog: languages/cyandm-*.po
Languages: fi

source: oops something went wrong
fi: Hups! Jotain meni pieleen

source: back to homepage
fi: takaisin kotisivulle

source: Contact Iprefab
fi: Ota yhteyttä Iprefabiin

source: Follow Us
fi: Seuraa meitä

source: profile
fi: Profiili

source: Blogs
fi: Blogi

source: phone
fi: puhelin

source: email
fi: sähkoposti

source: house
fi: Talo

source: price
fi: hinta

source: city
fi: kaupunki

source: house + land
fi: Talo + Tontti

source: information
fi: tiedot

source: land
fi: Tontti

source: exhibition
fi: TALONÄYTTELYT

source: Question
fi: kysymys

source: Forms
fi: Lomakkeet

source: Company
fi: Yritys

source: Faq Category
fi: kategoria

source: Form Category
fi: Lomakeluokka

source: contact us page
fi: ota meihin yhteyttä -sivu

source: contact popup
fi: yhteystieto ponnahdusikkuna

source: Home
fi: kotisivu

source: suppliers
fi: rakennuttajat

source: Contact us
fi: ota yhteyttä

source: About us
fi: meistä

source: search
fi: Hae

source: sorry , no posts found
fi: Anteeksi, sivua ei löytynyt

source: about us
fi: meistä

source: Houses Uploaded.
fi: talot löydetty

source: View
fi: Näytä

source: Lands Uploaded.
fi: Tontit löydetty

source: Companies Uploaded.
fi: yritykset löydetty

source: Import lands
fi: Tonttien tuonti

source: Import House
fi: kotien tuonti

source: Import Company
fi: Yrtysten tuonti

source: Upload Files
fi: lattaa tiedostaja

source: Filters
fi: Filtterit

source: filters
fi: Filtterit

source: sort by
fi: lajitella

source: Price Sort
fi: lajittelu hinnan

source: lowest
fi: Alhaisin hinta

source: highest
fi: Korkein hinta

source: sort
fi: lajittele

source: finland:
fi: Suomi:

source: items
fi: Tulokset

source: Homepage
fi: Etusivu

source: publish date
fi: päivämäärä

source: Full Name
fi: Nimi

source: Email
fi: sähkoposti

source: Phone
fi: puhelin

source: Price
fi: hinta

source: City
fi: kaupunki

source: Personal Info
fi: redpääpääää

source: Get Advice For
fi: lisä tietoja

source: you looking for ...
fi: etsit

source: house type
fi: Talo tyypit

source: Contact IPREFAB
fi: ota yhteyttä Iprefabiin

source: doesn't matter
fi: Ei haittaa

source: price min
fi: minimi hinta

source: price max
fi: Maximi hinta

source: area min
fi: minimi pinta-ala

source: area max
fi: maximi pinta-ala

source: Permit type
fi: rakennuslupa tyypit

source: apply filter
fi: Fliteri

source: other filters
fi: muut suodattimet

source: Search
fi: Hae

source: origin of company
fi: Rakennuttajan kotimaa

source: rooms
fi: huoneet

source: floors
fi: kerrokset

source: yes
fi: kyllä

source: surface min
fi: Tontin minimi pinta-ala

source: surface max
fi: Tontin maximi pinta-ala

source: view all
fi: Katso kaikki

source: Frequently Asked Questions
fi: usein kysytyt kysymykset

source: finland
fi: Suomi

source: please select an image
fi: valitse kuva

source: contact us
fi: ota yhteyttä

source: your name
fi: nimi

source: your email
fi: sähkoposti

source: Your Message
fi: viesti

source: send
fi: lähetä

source: Home Page
fi: kotisivu

source: The address of the house presentation
fi: Talonäyttelyn osoite

source: Guidance
fi: ohjet

source: show driving directions
fi: näytä ajo-ohjeet

source: collection
fi: Kokoelma

source: brochure
fi: esite

source: callback request
fi: Takaisinsoittopyyntö

source: visit builder
fi: Katso rakennutaja

source: Description
fi: kuvaus

source: Details
fi: yksityiskohdat

source: I accept have a land for this house
fi: minulla on tonttia

source: Order a bank request
fi: hae laina

source: add to calender
fi: lisää kalenteriin

source: call back request
fi: takaisinsoittopyyntö

source: Primary
fi: päätideot

source: neighborhood
fi: naapurusto

source: material
fi: materiaali

source: total area
fi: koko ala

source: house area
fi: pinta ala

source: balcony
fi: Parveke

source: garage
fi: Autotalli

source: kitchen appliances
fi: keittiön varusteet

source: bathroom appliances
fi: kylpyhuoneen varusteet

source: celling style
fi: Katto tyyppi

source: Facade / Material
fi: Julkisivu

source: garage (open or close)
fi: autotalli (avoin tai kiinni)

source: land details
fi: tontin yksityiskohdat

source: fee
fi: hinta

source: House Info
fi: Talon tiedot

source: Land Info
fi: Maatiedot

source: company verification type
fi: firman typpi

source: age of company
fi: yrityksen ikä

source: storage
fi: varasto

source: facade / material
fi: julkisivu

source: call
fi: puhelu

source: visit advertise
fi: käy mainostaa

source: building right
fi: rakennuslupa

source: contact name
fi: nimi

source: contact number
fi: puhelinnumero

source: permit type
fi: lupatyyppi

source: permit size
fi: Rakennusluvan koko

source: houses that are suitable for the land
fi: Tontille sopivat talot

source: you might like
fi: Saatat myös tykätä

source: Author
fi: kirjoittaja

source: Date
fi: päivämäärä

source: You might also like
fi: Saatat myös tykätä

source: archive suppliers
fi: piilota rakenuttaja

source: All Suppliers
fi: kaikki rakennuttajat

source: houses
fi: talot

source: visit website
fi: vieraile sivulla

source: call company
fi: yhteystiedot

source: about company
fi: yrityksestä

source: houses in IPREFAB
fi: Iprefabin talot
